Обработки/Reports/_ПроверкаСделокРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПроверкаСделокРЕПО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПроверкаСделокРЕПО/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Период		= ТекущаяДата();
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеВСписок(Список, Значение)
	
	НовыйЭлемент = Список.Добавить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СДУИВидыДДУПриИзменении(Элемент)
	
	Отчет.СчетаДоверительногоУправления.Очистить();
	Отчет.ВидыДоговоровДоверительногоУправления.Очистить();
	
	Для Каждого ТекЭлемент Из СДУИВидыДДУ Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда
			Если ТипЗнч(ТекЭлемент.Значение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.СчетаДоверительногоУправления, ТекЭлемент.Значение);
			ИначеЕсли ТипЗнч(ТекЭлемент.Значение) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.ВидыДоговоровДоверительногоУправления, ТекЭлемент.Значение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
